*** < int, int >

| R Th | Ops/th | Ops/sec |   Speedup | Efficiency | Latency (ns) | W Th | Ops/th | Ops/sec | Latency (ns) |
|------+--------+---------+-----------+------------+--------------+------+--------+---------+--------------|
|    0 |      0 |       0 |         0 |        0/0 |            0 |    1 |  58550 |   58550 |        17079 |
|    1 | 230811 |  230811 |         1 |          1 |         4332 |    1 |  45128 |   45128 |        22159 |
|    2 | 235658 |  471316 | 2.0419997 |  1.0209999 |         4243 |    1 |  46411 |   46411 |        21546 |
|    3 | 236854 |  710562 | 3.0785448 |  1.0261816 |         4222 |    1 |  44310 |   44310 |        22568 |
|    4 | 234269 |  937079 | 4.0599408 |  1.0149852 |         4268 |    1 |  44113 |   44113 |        22669 |
|------+--------+---------+-----------+------------+--------------+------+--------+---------+--------------|
|    5 | 231832 | 1159163 | 5.0221307 |  1.0044261 |         4313 |    1 |  44884 |   44884 |        22279 |
|    6 | 222366 | 1334200 | 5.7804871 | 0.96341452 |         4497 |    1 |  34169 |   34169 |        29266 |
|    7 | 220809 | 1545668 | 6.6966826 | 0.95666894 |         4528 |    1 |  40973 |   40973 |        24406 |
|    8 | 212901 | 1703213 | 7.3792540 | 0.92240675 |         4697 |    1 |  40583 |   40583 |        24640 |
|    9 | 196182 | 1765642 | 7.6497307 | 0.84997008 |         5097 |    1 |  41358 |   41358 |        24179 |
|------+--------+---------+-----------+------------+--------------+------+--------+---------+--------------|
|   10 | 206924 | 2069240 | 8.9650840 |  0.8965084 |         4832 |    1 |  31313 |   31313 |        31935 |
|   11 | 188228 | 2070515 | 8.9706080 | 0.81550982 |         5312 |    1 |  37390 |   37390 |        26745 |
|   12 | 182179 | 2186157 | 9.4716326 | 0.78930272 |         5489 |    1 |  38197 |   38197 |        26180 |
|   13 | 158044 | 2054575 | 8.9015472 |  0.6847344 |         6327 |    1 |  37080 |   37080 |        26968 |
|   14 | 156068 | 2184957 | 9.4664336 | 0.67617383 |         6407 |    1 |  21851 |   21851 |        45764 |
|------+--------+---------+-----------+------------+--------------+------+--------+---------+--------------|
|   15 | 127039 | 1905591 | 8.2560667 | 0.55040445 |         7871 |    1 |  38145 |   38145 |        26215 |
|   16 | 143795 | 2300729 | 9.9680215 | 0.62300134 |         6954 |    1 |  22550 |   22550 |        44345 |
|   17 | 139869 | 2377786 | 10.301875 | 0.60599265 |         7149 |    1 |  22217 |   22217 |        45010 |
|   18 | 120010 | 2160183 | 9.3590990 | 0.51994994 |         8332 |    1 |  36193 |   36193 |        27629 |
|   19 | 124384 | 2363310 | 10.239157 |   0.538903 |         8039 |    1 |  21758 |   21758 |        45960 |
|------+--------+---------+-----------+------------+--------------+------+--------+---------+--------------|
#+TBLFM: $4=$3/@3$3::$5=$4/$1

| R Th | Ops/th | Ops/sec | Latency (ns) | W Th | Ops/th | Ops/sec |    Speedup |  Efficiency | Latency (ns) |
|------+--------+---------+--------------+------+--------+---------+------------+-------------+--------------|
|    1 | 282598 |  282598 |         3538 |    0 |      0 |       0 |          0 |         0/0 |            0 |
|    1 | 217618 |  217618 |         4595 |    1 |  40376 |   40376 |          1 |           1 |        24767 |
|    1 | 231480 |  231480 |         4320 |    2 |  21202 |   42405 |  1.0502526 |   0.5251263 |        47165 |
|    1 | 224205 |  224205 |         4460 |    3 |  13112 |   39337 | 0.97426689 |  0.32475563 |        76266 |
|    1 | 218044 |  218044 |         4586 |    4 |   9100 |   36400 | 0.90152566 |  0.22538142 |       109890 |
|------+--------+---------+--------------+------+--------+---------+------------+-------------+--------------|
|    1 | 178072 |  178072 |         5615 |    5 |   6393 |   31966 | 0.79170795 |  0.15834159 |       156421 |
|    1 | 178155 |  178155 |         5613 |    6 |   5044 |   30264 | 0.74955419 |  0.12492570 |       198255 |
|    1 | 170522 |  170522 |         5864 |    7 |   3860 |   27020 | 0.66920943 | 0.095601347 |       259067 |
|    1 | 140027 |  140027 |         7141 |    8 |   3292 |   26337 | 0.65229344 |  0.08153668 |       303766 |
|    1 | 100785 |  100785 |         9922 |    9 |   2853 |   25679 | 0.63599663 | 0.070666292 |       350508 |
|------+--------+---------+--------------+------+--------+---------+------------+-------------+--------------|
|    1 | 117090 |  117090 |         8540 |   10 |   2408 |   24085 | 0.59651773 | 0.059651773 |       415282 |
|    1 | 132769 |  132769 |         7531 |   11 |   2399 |   26390 | 0.65360610 | 0.059418736 |       416840 |
|    1 | 149185 |  149185 |         6703 |   12 |   1974 |   23688 | 0.58668516 |  0.04889043 |       506585 |
|    1 | 153165 |  153165 |         6528 |   13 |   1822 |   23694 | 0.58683376 | 0.045141058 |       548847 |
|    1 | 133152 |  133152 |         7510 |   14 |   1767 |   24751 | 0.61301268 |  0.04378662 |       565930 |
|------+--------+---------+--------------+------+--------+---------+------------+-------------+--------------|
|    1 | 153601 |  153601 |         6510 |   15 |   1565 |   23488 | 0.58173172 | 0.038782115 |       638977 |
|    1 | 142068 |  142068 |         7038 |   16 |   1348 |   21577 | 0.53440162 | 0.033400101 |       741839 |
|    1 | 129551 |  129551 |         7718 |   17 |    927 |   15763 | 0.39040519 | 0.022965011 |      1078748 |
|    1 | 117273 |  117273 |         8527 |   18 |   1311 |   23604 | 0.58460472 |  0.03247804 |       762776 |
|    1 | 135346 |  135346 |         7388 |   19 |    791 |   15037 | 0.37242421 | 0.019601274 |      1264222 |
|------+--------+---------+--------------+------+--------+---------+------------+-------------+--------------|
#+TBLFM: $8=$7/@3$7::$9=$8/$5

